[
    {
        "id": "rust-trust",
        "title": "Rust doesn't tRust me",
        "date": "January 2, 2026",
        "body": "<p>I'm loving what I'm learning about Rust.</p><p>I had to stop and remark about this bit of code that I encountered early in my journey learning this language.  This is an very safe language.</p><p>Straight out of Steve Donovan's <a href=\"https://stevedonovan.github.io/rust-gentle-intro/readme.html\">\"A gentle Introduction to Rust\"</a> we hit a 'feature' of the compiler that put a smile on my face.</p><p>We start with the problem:</p><blockquote>\"Write a program that sums up the first 5 integers and display the results\"</blockquote><p>Sounds simple enough.</p><p>In Rust, he proposes this simple solution:</p><pre><code>fn main() {\n    let sum = 0;\n    for i in 0..5 {\n        sum += i;\n    }\n    println!(\"sum is {}\", sum);\n}</code></pre><p>The magic is in the compile ERROR (not a warning, and actual STOP IT, I REFUSE TO RUN THIS!)</p><pre style=\"color: #d32f2f; background-color: #fdecea; padding: 1rem;\"><code>error[E0384]: re-assignment of immutable variable `sum`</code></pre><p>What?  immutable?</p><blockquote style=\"border-left: 4px solid #ccc; padding-left: 1rem; margin-left: 0; font-style: italic;\"><strong>immutable</strong>: unchanging over time or unable to be changed.</blockquote><p>So, it looks like, by default, when you define a 'variable' - it's not variable!</p><p>you are not allowed to change the value of a variable unless you explicitly tell the compiler that it's 'changeable' or in programmer language 'mutable'</p><pre><code>let mut sum = 0;</code></pre><p>I don't belive I have ever come across a language that assumes immutable objects by default, but I see where we are going here.</p><p>Programmers are not to be trusted.   And I've been writing code for so long, that I know I can't trust myself either.</p><p>Rust doesn't tRust me.  I like this.</p>"
    },
    {
        "id": "inception",
        "title": "The Inception",
        "date": "December 30, 2025",
        "body": "<p>Welcome to 'The Journey'. This is a space where I will be documenting thoughts, technical challenges, and the evolution of OpenForge Solutions.</p><p>Today, we are starting simple: a JSON-backed content system that separates data from presentation, allowing us to focus on writing without the immediate overhead of a database.</p> <p> The beautiful thing is that I shamelessly used Gemini to write the basics of this system, because getting something into production fast - even if it's a little flawed, is so much better than spending hours on a perfect solution without delivering.</p>  <p> Most of the content of this website was generated with AI, especially the javascript, because writing javascript does not give me joy<p>"
    }
]